In [1]:
# cleaning earthquake

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('resources/earthquake_data.csv')

In [3]:
df.head()

,title,magnitude,date_time,cdi,mmi,alert,tsunami,sig,net,nst,dmin,gap,magType,depth,latitude,longitude,location,continent,country
0,"M 7.0 - 18 km SW of Malango, Solomon Islands",7.0,22-11-2022 02:03,8,7,green,1,768,us,117,0.509,17.0,mww,14.000,-9.7963,159.596,"Malango, Solomon Islands",Oceania,Solomon Islands
1,"M 6.9 - 204 km SW of Bengkulu, Indonesia",6.9,18-11-2022 13:37,4,4,green,0,735,us,99,2.229,34.0,mww,25.000,-4.9559,100.738,"Bengkulu, Indonesia",NaN,NaN
2,M 7.0 -,7.0,12-11-2022 07:09,3,3,green,1,755,us,147,3.125,18.0,mww,579.000,-20.0508,-178.346,NaN,Oceania,Fiji
3,"M 7.3 - 205 km ESE of Neiafu, Tonga",7.3,11-11-2022 10:48,5,5,green,1,833,us,149,1.865,21.0,mww,37.000,-19.2918,-172.129,"Neiafu, Tonga",NaN,NaN
4,M 6.6 -,6.6,09-11-2022 10:14,0,2,green,1,670,us,131,4.998,27.0,mww,624.464,-25.5948,178.278,NaN,NaN,NaN

In [5]:
df.columns

Index(['title', 'magnitude', 'date_time', 'cdi', 'mmi', 'alert', 'tsunami',
       'sig', 'net', 'nst', 'dmin', 'gap', 'magType', 'depth', 'latitude',
       'longitude', 'location', 'continent', 'country'],
      dtype='object')

In [7]:
# columns we keep:
# title
# magnitude
# date_time
# tsunami
# depth
# latitude
# longitude
# alert
# location
# continent
# country
# nst

df2 = df[['title', 'magnitude', 'date_time', 'alert','tsunami', 'nst',
         'depth','latitude','longitude','location','continent','country']]

In [8]:
df2.head()

,title,magnitude,date_time,alert,tsunami,nst,depth,latitude,longitude,location,continent,country
0,"M 7.0 - 18 km SW of Malango, Solomon Islands",7.0,22-11-2022 02:03,green,1,117,14.000,-9.7963,159.596,"Malango, Solomon Islands",Oceania,Solomon Islands
1,"M 6.9 - 204 km SW of Bengkulu, Indonesia",6.9,18-11-2022 13:37,green,0,99,25.000,-4.9559,100.738,"Bengkulu, Indonesia",NaN,NaN
2,M 7.0 -,7.0,12-11-2022 07:09,green,1,147,579.000,-20.0508,-178.346,NaN,Oceania,Fiji
3,"M 7.3 - 205 km ESE of Neiafu, Tonga",7.3,11-11-2022 10:48,green,1,149,37.000,-19.2918,-172.129,"Neiafu, Tonga",NaN,NaN
4,M 6.6 -,6.6,09-11-2022 10:14,green,1,131,624.464,-25.5948,178.278,NaN,NaN,NaN

In [9]:
df2.shape

(782, 12)

In [10]:
df2['date_time'].min()

'01-01-2001 06:57'

In [11]:
df2['date_time'].max()

'31-10-2019 01:11'

In [12]:
df_datetime = df2[['date_time']]

In [13]:
df_datetime.describe()

               date_time
count                782
unique               773
top     11-01-2022 11:35
freq                   3

In [14]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 782 entries, 0 to 781
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      782 non-null    object
 1   magnitude  782 non-null    float64
 2   date_time  782 non-null    object
 3   alert      415 non-null    object
 4   tsunami    782 non-null    int64
 5   nst        782 non-null    int64
 6   depth      782 non-null    float64
 7   latitude   782 non-null    float64
 8   longitude  782 non-null    float64
 9   location   777 non-null    object
 10  continent  206 non-null    object
 11  country    484 non-null    object
dtypes: float64(4), int64(2), object(6)
memory usage: 73.4+ KB

In [15]:
df2['date_time'].dtypes

dtype('O')

In [17]:
# create a new column, date_parsed, with the parsed dates
df2['date_parsed'] = pd.to_datetime(df2['date_time'])

/var/folders/5n/x9wtpy7x0nz5qk_by1cbdbk40000gp/T/ipykernel_44114/845880385.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['date_parsed'] = pd.to_datetime(df2['date_time'])

In [18]:
df2.head()

,title,magnitude,date_time,alert,tsunami,nst,depth,latitude,longitude,location,continent,country,date_parsed
0,"M 7.0 - 18 km SW of Malango, Solomon Islands",7.0,22-11-2022 02:03,green,1,117,14.000,-9.7963,159.596,"Malango, Solomon Islands",Oceania,Solomon Islands,2022-11-22 02:03:00
1,"M 6.9 - 204 km SW of Bengkulu, Indonesia",6.9,18-11-2022 13:37,green,0,99,25.000,-4.9559,100.738,"Bengkulu, Indonesia",NaN,NaN,2022-11-18 13:37:00
2,M 7.0 -,7.0,12-11-2022 07:09,green,1,147,579.000,-20.0508,-178.346,NaN,Oceania,Fiji,2022-12-11 07:09:00
3,"M 7.3 - 205 km ESE of Neiafu, Tonga",7.3,11-11-2022 10:48,green,1,149,37.000,-19.2918,-172.129,"Neiafu, Tonga",NaN,NaN,2022-11-11 10:48:00
4,M 6.6 -,6.6,09-11-2022 10:14,green,1,131,624.464,-25.5948,178.278,NaN,NaN,NaN,2022-09-11 10:14:00

In [19]:
df2['date_parsed'] = df2['date_parsed'].dt.date

/var/folders/5n/x9wtpy7x0nz5qk_by1cbdbk40000gp/T/ipykernel_44114/3868645672.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['date_parsed'] = df2['date_parsed'].dt.date

In [20]:
df2.head()

,title,magnitude,date_time,alert,tsunami,nst,depth,latitude,longitude,location,continent,country,date_parsed
0,"M 7.0 - 18 km SW of Malango, Solomon Islands",7.0,22-11-2022 02:03,green,1,117,14.000,-9.7963,159.596,"Malango, Solomon Islands",Oceania,Solomon Islands,2022-11-22
1,"M 6.9 - 204 km SW of Bengkulu, Indonesia",6.9,18-11-2022 13:37,green,0,99,25.000,-4.9559,100.738,"Bengkulu, Indonesia",NaN,NaN,2022-11-18
2,M 7.0 -,7.0,12-11-2022 07:09,green,1,147,579.000,-20.0508,-178.346,NaN,Oceania,Fiji,2022-12-11
3,"M 7.3 - 205 km ESE of Neiafu, Tonga",7.3,11-11-2022 10:48,green,1,149,37.000,-19.2918,-172.129,"Neiafu, Tonga",NaN,NaN,2022-11-11
4,M 6.6 -,6.6,09-11-2022 10:14,green,1,131,624.464,-25.5948,178.278,NaN,NaN,NaN,2022-09-11

In [21]:
len(df2['date_parsed'].unique())

673

In [22]:
df_dateparsed = df2[['date_parsed']]

In [23]:
df_dateparsed.describe()

       date_parsed
count          782
unique         673
top     2022-11-01
freq             7

In [24]:
df_dateparsed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 782 entries, 0 to 781
Data columns (total 1 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date_parsed  782 non-null    object
dtypes: object(1)
memory usage: 6.2+ KB

In [25]:
df_dateparsed['date_parsed'].min()

datetime.date(2001, 1, 1)

In [26]:
df_dateparsed['date_parsed'].max()

datetime.date(2022, 12, 11)

In [27]:
df_dateparsed.head(30)

   date_parsed
0   2022-11-22
1   2022-11-18
2   2022-12-11
3   2022-11-11
4   2022-09-11
5   2022-09-11
6   2022-09-11
7   2022-10-20
8   2022-09-22
9   2022-09-19
10  2022-09-18
11  2022-09-17
12  2022-09-14
13  2022-10-09
14  2022-05-09
15  2022-08-14
16  2022-07-27
17  2022-08-06
18  2022-05-26
19  2022-05-19
20  2022-10-05
21  2022-04-21
22  2022-03-31
23  2022-03-30
24  2022-03-22
25  2022-03-16
26  2022-03-13
27  2022-02-03
28  2022-02-16
29  2022-03-02

In [28]:
df2.drop('alert',axis=1, inplace=True)

/Users/j/opt/anaconda3/lib/python3.9/site-packages/pandas/core/frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [29]:
df2.shape

(782, 12)

In [30]:
df2.head()

,title,magnitude,date_time,tsunami,nst,depth,latitude,longitude,location,continent,country,date_parsed
0,"M 7.0 - 18 km SW of Malango, Solomon Islands",7.0,22-11-2022 02:03,1,117,14.000,-9.7963,159.596,"Malango, Solomon Islands",Oceania,Solomon Islands,2022-11-22
1,"M 6.9 - 204 km SW of Bengkulu, Indonesia",6.9,18-11-2022 13:37,0,99,25.000,-4.9559,100.738,"Bengkulu, Indonesia",NaN,NaN,2022-11-18
2,M 7.0 -,7.0,12-11-2022 07:09,1,147,579.000,-20.0508,-178.346,NaN,Oceania,Fiji,2022-12-11
3,"M 7.3 - 205 km ESE of Neiafu, Tonga",7.3,11-11-2022 10:48,1,149,37.000,-19.2918,-172.129,"Neiafu, Tonga",NaN,NaN,2022-11-11
4,M 6.6 -,6.6,09-11-2022 10:14,1,131,624.464,-25.5948,178.278,NaN,NaN,NaN,2022-09-11

In [31]:
nan_count_A = df2['country'].isna().sum()

In [32]:
nan_count_A

298

In [33]:
nan_count_B = df2['location'].isna().sum()
nan_count_B

5

In [34]:
# df2["country"] = df2["country"].fillna("unknown")

In [35]:
nan_count_C = df2['longitude'].isna().sum()
nan_count_C

0

In [36]:
df_country = df2.dropna(subset=['country','location','continent'], how='all')
print('\n', 'Missing values in the country column are : ', df_country['country'].isnull().sum())

 Missing values in the country column are :  295

In [38]:
df2.head()

,title,magnitude,date_time,tsunami,nst,depth,latitude,longitude,location,continent,country,date_parsed
0,"M 7.0 - 18 km SW of Malango, Solomon Islands",7.0,22-11-2022 02:03,1,117,14.000,-9.7963,159.596,"Malango, Solomon Islands",Oceania,Solomon Islands,2022-11-22
1,"M 6.9 - 204 km SW of Bengkulu, Indonesia",6.9,18-11-2022 13:37,0,99,25.000,-4.9559,100.738,"Bengkulu, Indonesia",NaN,NaN,2022-11-18
2,M 7.0 -,7.0,12-11-2022 07:09,1,147,579.000,-20.0508,-178.346,NaN,Oceania,Fiji,2022-12-11
3,"M 7.3 - 205 km ESE of Neiafu, Tonga",7.3,11-11-2022 10:48,1,149,37.000,-19.2918,-172.129,"Neiafu, Tonga",NaN,NaN,2022-11-11
4,M 6.6 -,6.6,09-11-2022 10:14,1,131,624.464,-25.5948,178.278,NaN,NaN,NaN,2022-09-11

In [39]:
## Now we refine the column, for analysing and visualising the data country-wise

## First we remove all the extra spaces in the country column (in fact, the code will erase all the extra spaces across the dataset)
df_country = df2[['country']]
df_country = df_country.applymap(lambda x: x.strip() if isinstance(x, str) else x)

## Next we refine some country names

df_country.replace({'country': {"the Fiji Islands" : "Fiji region", "Fiji" : "Fiji region", 
                                "the Kermadec Islands" : "New Zealand region", "the Loyalty Islands" : "New Caledonia", 
                                "Vanuatu" : "Vanuatu region", "South Sandwich Islands" : "South Sandwich Islands region", 
                                "South Georgia and the South Sandwich Islands" : "South Sandwich Islands region", 
                                "Prince Edward Islands region" : "Canada", "Okhotsk" : "Russia region", 
                                "off the west coast of northern Sumatra" : "Indonesia", 
                                "Philippine Islands region" : "Philippines", 
                                "the Kuril Islands" : "Kuril Islands", 
                                "United Kingdom of Great Britain and Northern Ireland (the)": "UK", 
                                "People's Republic of China": "CHINA", "United States of America": "USA", 
                                "Alaska": "USA", "Aleutian Islands, Alaska" : "USA", "California" : "USA", 
                                "India" : "India region", "Russia" : "Russia region", "New Zealand" : "New Zealand region", 
                                "Japan region" : "Japan"}}, inplace=True)

df_country['country'].unique()

array(['Solomon Islands', nan, 'Fiji region', 'Panama', 'Mexico',
       'Taiwan', 'Papua New Guinea', 'CHINA', 'Philippines', 'Brazil',
       'Peru', 'Argentina', 'Indonesia', 'USA', 'Antarctica',
       'Vanuatu region', 'Haiti', 'Japan', 'Mongolia', 'Greece', 'Chile',
       'Russia region', 'Turkey', 'UK', 'Ecuador',
       'South Sandwich Islands region', 'Venezuela', 'Bolivia',
       'Costa Rica', 'Iran', 'Guatemala', 'Botswana',
       'New Zealand region', 'Italy', 'Myanmar', 'Afghanistan',
       'India region', 'Tajikistan', 'Nepal', 'Nicaragua', 'Pakistan',
       'Colombia', 'Canada', 'Tonga', 'Kyrgyzstan', 'Martinique',
       'Mozambique', 'Tanzania', 'Algeria', 'El Salvador'], dtype=object)

In [40]:
df_country.head()

           country
0  Solomon Islands
1              NaN
2      Fiji region
3              NaN
4              NaN

In [42]:
df2.to_csv('resources/cleaned_dataframe.csv')

In [41]:
import sqlite3


# Read the CSV file into a DataFrame


# Connect to the SQLite database (or create it if it doesn't exist)
conn = sqlite3.connect('earthquake1.db')

# Write the DataFrame to the database
df2.to_sql('earthquake1', conn, if_exists='replace', index=False)

# Commit changes and close the connection
conn.commit()
conn.close()